# AreThinLinesEnabled Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ThinLinesOptions..::..AreThinLinesEnabled Property
ThinLinesOptions Class See Also
---
A static property defining if the 'Thin Lines' setting is on or off in current Revit Application Session.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015 Subscription Update
# Syntax
C#
---
```text
public static bool AreThinLinesEnabled { get; set; }
```

Visual Basic
---
```text
Public Shared Property AreThinLinesEnabled As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
static property bool AreThinLinesEnabled {
	bool get ();
	void set (bool value);
}
```

# Remarks
If user started multiple Revit sessions, and the 'Thin Lines' setting might be different in each session. Revit.ini file stores the lastest setting no matter what the Revit session is. The setting will be writen to Revit.ini if user set the value.
# See Also
ThinLinesOptions Class
Autodesk.Revit.UI Namespace